{
  "model": {
    "keras_version": "2.3.1",
    "backend": "tensorflow",
    "config": {
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 128, 128, 1],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "padding": "same",
            "activation": "relu",
            "name": "conv2d_1",
            "trainable": true,
            "batch_normalization": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid",
            "name": "max_pooling2d_1",
            "trainable": true
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_size": [3, 3],
            "padding": "same",
            "activation": "relu",
            "name": "conv2d_2",
            "trainable": true,
            "batch_normalization": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid",
            "name": "max_pooling2d_2",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1000,
            "activation": "softmax",
            "name": "output",
            "trainable": true
          }
        }
      ],
      "input_layers": [["input_1"]],
      "output_layers": [["output"]],
      "loss": "categorical_crossentropy",
      "optimizer": "adam",
      "metrics": ["accuracy"]
    }
  }
}